{
  "quantumContainer": {
    "title": "Quantum Storm: Ground Station",
    "audioSrc": "audio/nisha_kiran_convo.mp3",
    "transcript": [
      { "speaker": "Nisha", "start": 0, "end": 5, "text": "All quantum channels are stable. Entangled photon streams show zero decoherence." },
      { "speaker": "Kiran", "start": 6, "end": 10, "text": "Detectors calibrated perfectly. No interference from atmospheric turbulence." },
      { "speaker": "Alert System", "start": 10, "end": 13, "text": "⚠️ Geomagnetic storm detected!" },
      { "speaker": "Nisha", "start": 13, "end": 20, "text": "A geomagnetic storm? Check CME data from the solar observatories immediately." },
      { "speaker": "Kiran", "start": 20, "end": 28, "text": "It’s a massive CME! Solar plasma and magnetic fields are hitting the magnetosphere at over 2,000 km/s." },
      { "speaker": "Nisha", "start": 28, "end": 39, "text": "That’s huge. CME-induced geomagnetic currents can generate electromagnetic noise, which affects photon polarization and timing in our quantum channels." },
      { "speaker": "Kiran", "start": 39, "end": 42, "text": "Are satellites in low Earth orbit exposed?" },
      { "speaker": "Nisha", "start": 42, "end": 54, "text": "Partially, yes. Satellites with poor shielding may see bit errors, but ground-based detectors are at risk too unless we use Faraday cages and backup channels." },
      { "speaker": "Nisha", "start": 54, "end": 62, "text": "Activate error-correction protocols on all quantum key distribution channels. Halt non-essential photon transmissions." },
      { "speaker": "Kiran", "start": 62, "end": 67, "text": "Switching to shielded backup ground stations with redundant photon detectors." },
      { "speaker": "Nisha", "start": 67, "end": 77, "text": "Monitor geomagnetic activity every 10 seconds. Any sudden spike in local magnetic fields requires recalibration or temporary shutdown of channels." },
      { "speaker": "Kiran", "start": 77, "end": 83, "text": "Even cosmic storms demand strict operational protocols." },
      { "speaker": "Nisha", "start": 83, "end": 96, "text": "CMEs demonstrate the fragility of even cutting-edge quantum systems. Magnetic fluctuations can rotate photon polarization, scramble entangled pairs, or introduce timing jitter." },
      { "speaker": "Kiran", "start": 96, "end": 100, "text": "So, the storm itself is like a stress test for our infrastructure." },
      { "speaker": "Nisha", "start": 100, "end": 108, "text": "Exactly. Each event improves our understanding of shielding techniques, error-correction codes, and system redundancy." },
      { "speaker": "Kiran", "start": 108, "end": 113, "text": "And knowing CME patterns helps predict when to preemptively switch to safe modes." },
      { "speaker": "Nisha", "start": 113, "end": 123, "text": "Yes—learning from these events is how we ensure secure, reliable communication in space and on Earth." },
      { "speaker": "Kiran", "start": 123, "end": 127, "text": "Geomagnetic activity dropping. Quantum links are back to full fidelity." },
      { "speaker": "Nisha", "start": 127, "end": 135, "text": "All channels verified. No significant data loss. Shielding, redundancy, and rapid response prevented system failures." },
      { "speaker": "Kiran", "start": 135, "end": 141, "text": "Lesson learned: preemptive measures and real-time monitoring are crucial for space-based quantum networks." },
      { "speaker": "Nisha", "start": 141, "end": 151, "text": "And now we’re better equipped for future solar events, ensuring secure communication even during extreme space weather." },
      { "speaker": "Nisha", "start": 151, "end": 173, "text": "Kiran, CMEs may travel millions of kilometers, but they remind us that even the most advanced quantum systems must plan for solar events. Proper shielding, error correction, and operational protocols turn cosmic threats into lessons for reliable, secure communication." }
    ]
  },
    "elecEnggContainer": {
        "title": "Power Grid & Solar Flares",
        "audioSrc": "audio/Het_Nisha_convo.mp3",
        "transcript": [
            { "speaker": "Het", "start": 0, "end": 5, "text": "Morning, Nisha. All substations look normal, voltages stable, and load balanced." },
            { "speaker": "Nisha", "start": 5, "end": 14, "text": "Good, Het. But I just got a space weather alert: a Coronal Mass Ejection (CME) is expected to hit Earth in the next few hours." },
            { "speaker": "Het", "start": 14, "end": 19, "text": "CME… that’s a massive solar storm, right? How will it affect our grid?" },
            { "speaker": "Nisha", "start": 19, "end": 28, "text": "High-energy particles can induce currents in long transmission lines, potentially causing voltage fluctuations or equipment tripping. We need to act fast." },
            { "speaker": "Het", "start": 28, "end": 34, "text": "I’m seeing sudden spikes on the monitoring screens… some transformers are nearing overload!" },
            { "speaker": "Nisha", "start": 34, "end": 44, "text": "Yes. The CME is sending charged particles that can induce geomagnetically induced currents in our lines. Electronics are fine, but our grid could trip if we don’t intervene." },
            { "speaker": "Het", "start": 44, "end": 48, "text": "So this is what they mean by space weather affecting Earth infrastructure?" },
            { "speaker": "Nisha", "start": 48, "end": 55, "text": "Exactly. It’s rare but real. Power grids are vulnerable to solar storms if not prepared." },
            { "speaker": "Het", "start": 55, "end": 56, "text": "What’s our action plan?" },
            { "speaker": "Nisha", "start": 56, "end": 64, "text": "Switch key transformers to low-load mode, activate backup circuits, and alert field teams to monitor critical points manually." },
            { "speaker": "Het", "start": 64, "end": 70, "text": "Got it. I’ll also log all fluctuations and keep communication active with the regional control centers." },
            { "speaker": "Nisha", "start": 70, "end": 75, "text": "Perfect. Safety first, but maintain grid stability as much as possible." },
            { "speaker": "Het", "start": 75, "end": 81, "text": "It’s impressive… something happening millions of kilometers away is affecting our systems here." },
            { "speaker": "Nisha", "start": 81, "end": 89, "text": "Yes, CMEs remind us that even distant events can have terrestrial consequences. Planning and preparation are crucial." },
            { "speaker": "Het", "start": 89, "end": 94, "text": "So, engineers must design for resilience and have manual backup protocols?" },
            { "speaker": "Nisha", "start": 94, "end": 102, "text": "Exactly. Technology is powerful, but understanding natural phenomena and acting proactively is what keeps the lights on." },
            { "speaker": "Het", "start": 102, "end": 106, "text": "Voltages are back to normal, transformers stable, and the grid never tripped!" },
            { "speaker": "Nisha", "start": 106, "end": 111, "text": "Excellent. Your quick response and adherence to protocols protected the system." },
            { "speaker": "Het", "start": 111, "end": 119, "text": "Lesson learned: anticipating space weather and combining tech with hands-on monitoring ensures safety and continuity." },
            { "speaker": "Nisha", "start": 119, "end": 125, "text": "And every CME teaches engineers how to make infrastructure stronger and smarter." },
            { "speaker": "Het", "start": 125, "end": 132, "text": "Nisha, so space weather isn’t just an abstract concept—it can really impact our power systems?" },
            { "speaker": "Nisha", "start": 132, "end": 145, "text": "Yes, Het. CMEs can induce currents that disrupt grids, but with planning, monitoring, and proactive measures, engineers can safeguard electricity supply and keep society powered." }
        ]
    },
    "farmerContainer": {
        "title": "Farm & Solar Storms",
        "audioSrc": "audio/vatsal_farah_convo.mp3",
        "transcript": [
            { "speaker": "Farah", "start": 0, "end": 2, "text": "Good morning, Vatsal! The crops look healthy today." },
            { "speaker": "Vatsal", "start": 2, "end": 14, "text": "Morning, Farah. They’re thriving. But I just received a space weather alert—Coronal Mass Ejection (CME) expected to impact Earth’s magnetosphere today." },
            { "speaker": "Farah", "start": 14, "end": 20, "text": "CME? That’s from the Sun, right? How does that affect my farm?" },
            { "speaker": "Vatsal", "start": 20, "end": 29, "text": "Yes. These solar storms can disrupt GPS, communication systems, and even some automated farm equipment. Time to prepare." },
            { "speaker": "Farah", "start": 29, "end": 35, "text": "I just noticed our drones are losing connection, and the irrigation system is acting strange." },
            { "speaker": "Vatsal", "start": 35, "end": 51, "text": "Exactly. The CME is sending charged particles toward Earth, temporarily interfering with electronics. Nothing is physically damaged, but signals can fluctuate." },
            { "speaker": "Farah", "start": 51, "end": 56, "text": "So my modern tech can fail just because of the Sun?" },
            { "speaker": "Vatsal", "start": 56, "end": 61, "text": "Yes. It’s a reminder to have backup plans for critical farm operations." },
            { "speaker": "Farah", "start": 61, "end": 72, "text": "What should I do? The crops need watering, and drones were supposed to survey the fields." },
            { "speaker": "Vatsal", "start": 72, "end": 77, "text": "Switch to manual controls for irrigation. Use traditional tools for monitoring crops. Keep notes by hand—sometimes old methods work best." },
            { "speaker": "Farah", "start": 77, "end": 85, "text": "Got it. I’ll walk the fields and check soil moisture manually. The drones can wait." },
            { "speaker": "Vatsal", "start": 85, "end": 88, "text": "Good. Also, document what’s happening—this can help improve farm protocols for future space weather events." },
            { "speaker": "Farah", "start": 88, "end": 99, "text": "I never realized the Sun could affect my work so directly!" },
            { "speaker": "Vatsal", "start": 99, "end": 103, "text": "Solar activity teaches us that technology is powerful but not infallible. Learning to adapt ensures productivity even during disruptions." },
            { "speaker": "Farah", "start": 103, "end": 112, "text": "So combining traditional skills with modern tech is the key?" },
            { "speaker": "Vatsal", "start": 112, "end": 116, "text": "Exactly. CME storms remind farmers to be observant, flexible, and prepared for unexpected challenges." },
            { "speaker": "Farah", "start": 116, "end": 122, "text": "The drones are back online, irrigation systems stabilized, and crops are safe." },
            { "speaker": "Vatsal", "start": 122, "end": 127, "text": "Well done! You managed the storm efficiently and kept productivity high." },
            { "speaker": "Farah", "start": 127, "end": 133, "text": "Lesson learned: technology is amazing, but preparation and adaptability make it reliable." },
            { "speaker": "Vatsal", "start": 133, "end": 139, "text": "And every CME teaches us more about resilience and smart farm management." },
            { "speaker": "Farah", "start": 139, "end": 144, "text": "Vatsal, so space weather isn’t just science news—it really impacts daily life?" },
            { "speaker": "Vatsal", "start": 144, "end": 153, "text": "Yes, Farah. CMEs can disrupt electronics, GPS, and automated systems, but with preparation, flexibility, and a mix of traditional and modern methods, farmers can stay productive and safe." }
        ]
    },
    "astroArjunContainer": {
        "title": "ISS Emergency: Astronauts' View",
        "audioSrc": "audio/Arjun_anika_convo.mp3",
        "transcript": [
            { "speaker": "Arjun", "start": 0, "end": 5, "text": "Commander Anika, everything looks stable. Earth is peaceful, and the instruments are normal." },
            { "speaker": "Anika", "start": 5, "end": 12, "text": "Yes, Arjun. But the Sun can surprise us at any moment. Even up here, space weather can change rapidly." },
            { "speaker": "Arjun", "start": 12, "end": 15, "text": "It’s hard to imagine danger when everything seems so calm." },
            { "speaker": "Anika", "start": 15, "end": 23, "text": "That’s exactly why constant vigilance is essential. One CME can affect us within minutes." },
            { "speaker": "Arjun", "start": 23, "end": 29, "text": "Commander, the radiation monitor is spiking! Levels are rising sharply." },
            { "speaker": "Anika", "start": 29, "end": 36, "text": "This is a Coronal Mass Ejection approaching our orbit. High-energy particles from the Sun are headed this way." },
            { "speaker": "Arjun", "start": 36, "end": 39, "text": "How dangerous is this for us and our instruments?" },
            { "speaker": "Anika", "start": 39, "end": 48, "text": "CMEs can interfere with electronics, disrupt communication, and increase radiation exposure for the crew. Immediate protective measures are crucial." },
            { "speaker": "Anika", "start": 48, "end": 57, "text": "Arjun, move critical experiments into shielded racks and shut down non-essential systems. Activate backup power for essential modules." },
            { "speaker": "Arjun", "start": 57, "end": 62, "text": "Understood. Logging real-time radiation readings for analysis and future missions." },
            { "speaker": "Anika", "start": 62, "end": 71, "text": "Good. Check that all crew members are in designated shielded zones. Ensure life-support systems are fully functional and monitored." },
            { "speaker": "Arjun", "start": 71, "end": 78, "text": "All crew secured. Radiation monitors active. Experiments safely paused. Backup instruments online." },
            { "speaker": "Anika", "start": 78, "end": 86, "text": "Remember, redundancy and preparation are our first line of defense. Every action now prevents possible damage or data loss." },
            { "speaker": "Arjun", "start": 86, "end": 92, "text": "It’s incredible… particles from the Sun millions of kilometers away can affect us this quickly." },
            { "speaker": "Anika", "start": 92, "end": 102, "text": "Exactly. CMEs remind us that space is a dynamic environment. Protecting instruments, following protocols, and constant monitoring are key." },
            { "speaker": "Arjun", "start": 102, "end": 105, "text": "So observing and recording data during the storm is important?" },
            { "speaker": "Anika", "start": 105, "end": 117, "text": "Absolutely. Even disrupted data helps us improve models for predicting future CMEs. Each storm teaches us how to design better shielding and plan crew safety measures." },
            { "speaker": "Arjun", "start": 117, "end": 120, "text": "It’s like turning a threat into a learning opportunity." },
            { "speaker": "Anika", "start": 120, "end": 126, "text": "Yes. Understanding space weather allows us to minimize risks and maximize scientific gain." },
            { "speaker": "Arjun", "start": 126, "end": 130, "text": "Radiation levels returning to normal… systems back online." },
            { "speaker": "Anika", "start": 130, "end": 137, "text": "Excellent. Shields worked, crew safe, and instruments intact. We followed procedures and stayed ahead of the storm." },
            { "speaker": "Arjun", "start": 137, "end": 142, "text": "The Sun’s power is impressive, but preparation made all the difference." },
            { "speaker": "Anika", "start": 142, "end": 150, "text": "Every CME we experience improves our training, our technology, and our ability to protect future astronauts and missions." },
            { "speaker": "Arjun", "start": 150, "end": 155, "text": "Commander Anika, so CMEs really can impact astronauts and instruments?" },
            { "speaker": "Anika", "start": 155, "end": 170, "text": "Yes, Arjun. But with monitoring, shielding, backup systems, and careful procedures, we can survive solar storms—and each one teaches us how to be safer, smarter, and better prepared for the next challenge." }
        ]
    },
    "photographerNishitaContainer": {
        "title": "Aurora Chasers",
        "audioSrc": "audio/nishita_tara_convo.mp3",
        "transcript": [
            { "speaker": "Nishita", "start": 0, "end": 4, "text": "Tonight’s auroras are going to be incredible—I can feel it!" },
            { "speaker": "Tara", "start": 4, "end": 8, "text": "The sky looks calm… are you sure the flare will make them appear?" },
            { "speaker": "Nishita", "start": 8, "end": 18, "text": "Yes! Solar flares push charged particles into Earth’s atmosphere, creating brighter, more colorful auroras. This is our chance for an amazing shot!" },
            { "speaker": "Tara", "start": 18, "end": 22, "text": "Wow… the sky is glowing red, green, and purple!" },
            { "speaker": "Nishita", "start": 22, "end": 27, "text": "Wait… my digital camera just shut down. The battery drained instantly." },
            { "speaker": "Tara", "start": 27, "end": 32, "text": "My phone froze too… GPS and compass aren’t responding." },
            { "speaker": "Nishita", "start": 32, "end": 38, "text": "The solar flare is affecting electronics. Even devices on the ground can fail when space weather hits." },
            { "speaker": "Nishita", "start": 38, "end": 43, "text": "Time to go old-school. No circuits—just light, film, and patience." },
            { "speaker": "Tara", "start": 43, "end": 46, "text": "So the flare can’t stop us?" },
            { "speaker": "Nishita", "start": 46, "end": 52, "text": "Exactly. We adapt. Technology may fail, but knowledge and creativity keep us going." },
            { "speaker": "Tara", "start": 52, "end": 56, "text": "It’s like the Sun itself is testing our skills!" },
            { "speaker": "Nishita", "start": 56, "end": 61, "text": "The solar flare reminded me that modern devices are fragile, but ingenuity and preparation can overcome obstacles." },
            { "speaker": "Tara", "start": 61, "end": 66, "text": "And the auroras… they’re more vivid than anything I’ve seen. Nature’s display is mesmerizing." },
            { "speaker": "Nishita", "start": 66, "end": 70, "text": "We learn two lessons: respect the power of the Sun, and remember that understanding it helps us adapt safely." },
            { "speaker": "Tara", "start": 70, "end": 73, "text": "The auroras are fading… electronics are back to normal." },
            { "speaker": "Nishita", "start": 73, "end": 77, "text": "Yes, and we still captured incredible images. Lesson learned: preparation and adaptability are as important as skill." },
            { "speaker": "Tara", "start": 77, "end": 79, "text": "Solar storms disrupt, but they also inspire awe." },
            { "speaker": "Nishita", "start": 79, "end": 86, "text": "Exactly. Danger teaches caution, and curiosity teaches wonder." },
            { "speaker": "Tara", "start": 86, "end": 91, "text": "Nishita, so solar flares aren’t just dangerous—they’re opportunities to learn?" },
            { "speaker": "Nishita", "start": 91, "end": 116, "text": "Yes, Tara. They can disrupt electronics, but by adapting and understanding space weather, we safely observe and even enjoy their beauty. Preparation turns challenges into discovery." }
        ]
    },
    "captainMarco": {
        "title": "Maritime Navigation Flare",
        "audioSrc": "audio/marco_sofia_convo.mp3",
        "transcript": [
            { "speaker": "Captain Marco", "start": 0, "end": 6, "text": "The ocean looks endless and calm tonight. Perfect for navigation." },
            { "speaker": "First Mate Sofia", "start": 6, "end": 11, "text": "Aye, Captain. Stars above, waves below—easy to find our way." },
            { "speaker": "Captain Marco", "start": 11, "end": 19, "text": "Solar storms at sea? Let’s see what this teaches us about preparation and adaptability." },
            { "speaker": "First Mate Sofia", "start": 19, "end": 24, "text": "Captain, the compass is spinning wildly—it won’t hold north!" },
            { "speaker": "Captain Marco", "start": 24, "end": 31, "text": "Impossible… compasses don’t lie. Wait—radar and radios are down too!" },
            { "speaker": "First Mate Sofia", "start": 31, "end": 33, "text": "Could it be a solar flare?" },
            { "speaker": "Captain Marco", "start": 33, "end": 42, "text": "Yes. The Sun’s burst is disturbing Earth’s magnetic field. Our instruments are temporarily affected." },
            { "speaker": "Captain Marco", "start": 42, "end": 50, "text": "Stay calm. Time to go back to basics—sextant, stars, and steady hands." },
            { "speaker": "First Mate Sofia", "start": 50, "end": 54, "text": "So no instruments, just navigation by the stars?" },
            { "speaker": "Captain Marco", "start": 54, "end": 61, "text": "Exactly. Technology may fail, but sailors who know the fundamentals are never lost." },
            { "speaker": "First Mate Sofia", "start": 61, "end": 63, "text": "Course plotted manually. Crew is ready to follow orders." },
            { "speaker": "First Mate Sofia", "start": 63, "end": 66, "text": "It’s amazing… the sky glows with auroras over the horizon!" },
            { "speaker": "Captain Marco", "start": 66, "end": 73, "text": "That’s the solar flare interacting with Earth’s magnetic field. Beautiful, but it reminds us that nature can override our machines." },
            { "speaker": "First Mate Sofia", "start": 73, "end": 75, "text": "So we can’t rely solely on technology." },
            { "speaker": "Captain Marco", "start": 75, "end": 82, "text": "Right. Knowledge, preparation, and adaptability are key to navigating safely—even in extreme conditions." },
            { "speaker": "First Mate Sofia", "start": 82, "end": 85, "text": "Captain, radios are clear again. Compass is steady." },
            { "speaker": "Captain Marco", "start": 85, "end": 90, "text": "Good. The storm has passed, and we stayed safe." },
            { "speaker": "First Mate Sofia", "start": 90, "end": 95, "text": "We learned that the Sun can affect the sea just like the sky." },
            { "speaker": "Captain Marco", "start": 95, "end": 100, "text": "Exactly. Solar flares remind us to respect nature, use technology wisely, and always know the basics." },
            { "speaker": "First Mate Sofia", "start": 100, "end": 105, "text": "Captain Marco, so solar flares aren’t just a curiosity—they’re a real challenge at sea?" },
            { "speaker": "Captain Marco", "start": 105, "end": 120, "text": "Yes, Sofia. They can disrupt navigation, radios, and compasses, but by combining preparation, knowledge, and traditional skills, sailors can stay safe and turn challenges into lessons." }
        ]
    },
    "astronautAlexContainer": {
        "title": "Space Station Flare",
        "audioSrc": "audio/Alex_riya_convo.mp3",
        "transcript": [
            { "speaker": "Alex", "start": 0, "end": 6, "text": "Commander Riya, Earth looks so calm from here. It feels unreal." },
            { "speaker": "Riya", "start": 6, "end": 17, "text": "Yes, Alex. But never forget—the Sun controls space weather, and it can change suddenly. Even small changes can affect satellites and astronauts." },
            { "speaker": "Alex", "start": 17, "end": 21, "text": "Commander, the radiation detector shows a sudden spike!" },
            { "speaker": "Riya", "start": 21, "end": 28, "text": "That’s a solar flare. It’s a sudden burst of energy and radiation from the Sun heading toward us." },
            { "speaker": "Alex", "start": 28, "end": 30, "text": "So, what should we do first?" },
            { "speaker": "Riya", "start": 30, "end": 40, "text": "Move to the storm shelter module immediately and power down sensitive systems. Protecting our instruments is just as important as protecting ourselves." },
            { "speaker": "Alex", "start": 40, "end": 44, "text": "Lights are flickering! Communication is breaking up!" },
            { "speaker": "Riya", "start": 44, "end": 53, "text": "Stay calm. The shielding in the shelter will block most harmful radiation. Focus on procedures, not panic." },
            { "speaker": "Alex", "start": 53, "end": 58, "text": "Understood. Shutting down non-essential systems now and monitoring radiation levels." },
            { "speaker": "Riya", "start": 58, "end": 62, "text": "Exactly. Quick and careful actions keep both us and our instruments safe." },
            { "speaker": "Alex", "start": 62, "end": 67, "text": "Commander, it’s so quiet here… but the detectors are recording huge fluctuations in radiation." },
            { "speaker": "Riya", "start": 67, "end": 73, "text": "Good. That data is extremely valuable. Every solar flare teaches us more about the Sun’s impact on satellites, communications, and space travel." },
            { "speaker": "Alex", "start": 73, "end": 76, "text": "So even though we’re stuck in the shelter, we’re contributing to science?" },
            { "speaker": "Riya", "start": 76, "end": 84, "text": "Yes. Observing, protecting, and recording—that’s how we turn danger into knowledge. Each storm prepares future astronauts and engineers for what’s coming." },
            { "speaker": "Alex", "start": 84, "end": 85, "text": "Radiation levels dropping—systems are back to normal!" },
            { "speaker": "Riya", "start": 85, "end": 90, "text": "Excellent. By following procedures, we stayed safe and kept our instruments operational." },
            { "speaker": "Alex", "start": 90, "end": 95, "text": "The lesson is clear: solar flares are dangerous, but preparation, calm action, and knowledge protect us." },
            { "speaker": "Riya", "start": 95, "end": 126, "text": "And what we learn here helps protect satellites, power grids, and communication systems on Earth. Science and caution go hand in hand." },
            { "speaker": "Alex", "start": 126, "end": 130, "text": "Commander Riya, so solar flares are not just a threat—they’re a learning opportunity?" },
            { "speaker": "Riya", "start": 130, "end": 152, "text": "Exactly, Alex. They can harm astronauts, satellites, and communications, but by observing carefully, shielding properly, and following procedures, we turn each flare into a lesson for everyone on Earth and in space." }
        ]
    },
    "pilotPriyaContainer": {
        "title": "Pilot & Solar Flare",
        "audioSrc": "audio/Priya_Nila_convo.mp3",
        "transcript": [
            { "speaker": "Priya", "start": 0, "end": 5, "text": "Control, this is Flight 72. The skies are calm, engines steady, passengers relaxed." },
            { "speaker": "Nila", "start": 5, "end": 11, "text": "Good to hear, Priya. Just remember—space weather can sometimes affect flights, especially near the poles." },
            { "speaker": "Priya", "start": 11, "end": 15, "text": "Space weather? I thought that was only an astronaut’s problem." },
            { "speaker": "Priya", "start": 15, "end": 20, "text": "Tower, my radio just crackled… and my GPS shows we’re flying in circles!" },
            { "speaker": "Nila", "start": 20, "end": 27, "text": "Stay calm, Priya. A solar flare just erupted—it’s disturbing radio and navigation signals." },
            { "speaker": "Priya", "start": 27, "end": 31, "text": "So that explains the glitches. What’s my next step?" },
            { "speaker": "Nila", "start": 31, "end": 36, "text": "Switch to backup instruments and use manual navigation until the storm passes." },
            { "speaker": "Priya", "start": 36, "end": 42, "text": "Roger that. Switching off GPS… trusting the horizon, altimeter, and standby compass." },
            { "speaker": "Nila", "start": 42, "end": 50, "text": "Good. And maintain communication checks every few minutes. If signals drop completely, stick to your manual course." },
            { "speaker": "Priya", "start": 50, "end": 56, "text": "Passengers may notice the turbulence in comms. I’ll make an announcement to keep them calm." },
            { "speaker": "Priya", "start": 56, "end": 61, "text": "Nila, it’s strange… I usually rely so much on GPS, but flying this way feels like going back to basics." },
            { "speaker": "Nila", "start": 61, "end": 65, "text": "Exactly. Solar flares remind us that technology is powerful—but not unshakable." },
            { "speaker": "Priya", "start": 65, "end": 68, "text": "So the lesson is: always trust training, not just machines." },
            { "speaker": "Nila", "start": 68, "end": 72, "text": "Correct. That’s why pilots practice manual navigation. Preparation turns panic into control." },
            { "speaker": "Priya", "start": 72, "end": 75, "text": "Tower, signals are back! GPS locked, radios clear again." },
            { "speaker": "Nila", "start": 75, "end": 77, "text": "Well done, Priya. You kept calm and safe during the flare." },
            { "speaker": "Priya", "start": 77, "end": 79, "text": "I never thought the Sun could interfere with airplanes, but now I know." },
            { "speaker": "Nila", "start": 79, "end": 84, "text": "Yes—solar storms can disturb flights, satellites, and power grids. But training and teamwork keep us safe." },
            { "speaker": "Priya", "start": 84, "end": 115, "text": "Solar flares are bursts of energy from the Sun that can disturb airplane radios and GPS, especially on polar routes—but by staying calm, trusting training, and using backup systems, pilots can safely navigate through space weather and protect everyone onboard." }
        ]
    },
    "marineBiologistAishaContainer": {
        "title": "Deep Sea Solar Wind",
        "audioSrc": "audio/aisha_ravi_convo.mp3",
        "transcript": [
            { "speaker": "Dr. Aisha", "start": 0, "end": 9, "text": "These hydrophones are mapping whale calls across 200 km. With satellite relays, we track their migration perfectly." },
            { "speaker": "Ravi", "start": 9, "end": 16, "text": "Data link is crystal clear. Ocean currents and salinity readings are syncing with the satellites." },
            { "speaker": "Dr. Aisha", "start": 16, "end": 24, "text": "Hmm… let’s see how this plays out. Solar wind means charged particles buffeting Earth’s magnetic shield." },
            { "speaker": "Ravi", "start": 24, "end": 31, "text": "Dr. Aisha, sonar pings are unstable, satellite link keeps dropping." },
            { "speaker": "Dr. Aisha", "start": 31, "end": 37, "text": "That’s solar wind disturbing the magnetosphere. It’s scrambling radio and satellite transmissions." },
            { "speaker": "Ravi", "start": 37, "end": 42, "text": "Our underwater cable sensors are jittering too—like false signals." },
            { "speaker": "Dr. Aisha", "start": 42, "end": 51, "text": "Exactly. The induced geomagnetic currents from solar storms can flow through long cables—even undersea ones." },
            { "speaker": "Dr. Aisha", "start": 51, "end": 57, "text": "Shut down high-voltage connections to the seabed sensors. If a surge hits, we could fry them." },
            { "speaker": "Ravi", "start": 57, "end": 61, "text": "Switching to insulated battery packs. Should we stop recording?" },
            { "speaker": "Dr. Aisha", "start": 61, "end": 69, "text": "No—switch to local storage mode. Even if satellite uplink is gone, raw data must be preserved." },
            { "speaker": "Ravi", "start": 69, "end": 71, "text": "For navigation?" },
            { "speaker": "Dr. Aisha", "start": 71, "end": 77, "text": "Use dead reckoning and acoustic beacons. GPS is unreliable during solar storms." },
            { "speaker": "Ravi", "start": 77, "end": 80, "text": "It feels like the ocean itself is glitching." },
            { "speaker": "Dr. Aisha", "start": 80, "end": 90, "text": "That’s the hidden link: space weather shapes ocean science. Without stable satellites, we lose navigation, climate models, even whale migration maps." },
            { "speaker": "Ravi", "start": 92, "end": 98, "text": "So, solar storms affect not just astronauts and pilots—but ocean researchers too." },
            { "speaker": "Dr. Aisha", "start": 98, "end": 111, "text": "Yes. In fact, undersea cables—the backbone of the internet—can suffer from solar wind–induced currents. Imagine global communications flickering just like our sonar." },
            { "speaker": "Ravi", "start": 111, "end": 115, "text": "And here we are, learning resilience in the middle of the ocean." },
            { "speaker": "Dr. Aisha", "start": 115, "end": 125, "text": "Exactly. The Sun reminds us: study Earth as a system—sky, sea, and science all connected." },
            { "speaker": "Ravi", "start": 125, "end": 128, "text": "Systems are stable again. Nothing lost." },
            { "speaker": "Dr. Aisha", "start": 128, "end": 138, "text": "Good. Because we anticipated the storm, our instruments survived, and we gained rare data on how solar wind affects deep-sea sensors." },
            { "speaker": "Ravi", "start": 138, "end": 141, "text": "Today, the Sun taught us as much as the ocean." },
            { "speaker": "Dr. Aisha", "start": 141, "end": 148, "text": "Yes—science grows at the edge of both worlds: deep sea and deep space." },
            { "speaker": "Dr. Aisha", "start": 148, "end": 163, "text": "Solar wind is a stream of charged particles from the Sun. It disturbs satellites, navigation, and even undersea cables. For scientists, adapting with backups, shielding, and manual methods keeps research alive." },
            { "speaker": "Ravi", "start": 164, "end": 171, "text": "And remember: when space weather touches the sea, preparation turns disruption into discovery." }
        ]
    },
    "satelliteSamContainer": {
        "title": "Satellite Sam's Storm",
        "audioSrc": "audio/sam_mira_convo.mp3",
        "transcript": [
            { "speaker": "Sam", "start": 0, "end": 5, "text": "Hello, Professor Mira! Earth looks so calm and pretty from up here." },
            { "speaker": "Mira", "start": 5, "end": 13, "text": "Glad to hear, Sam. But remember, space can change quickly. We must always stay prepared." },
            { "speaker": "Sam", "start": 13, "end": 18, "text": "Warning! My sensors detect a powerful burst from the Sun!" },
            { "speaker": "Mira", "start": 18, "end": 26, "text": "That’s a solar storm, Sam. It can shake satellites and disturb signals. Stay steady and follow safety steps." },
            { "speaker": "Sam", "start": 26, "end": 33, "text": "Whoa! The storm is rattling my solar panels and filling me with static!" },
            { "speaker": "Mira", "start": 33, "end": 40, "text": "Don’t panic. Turn your strongest side toward the storm, save your battery, and protect your main antenna." },
            { "speaker": "Sam", "start": 40, "end": 46, "text": "Got it! Shutting down non-essential systems… stabilizing now!" },
            { "speaker": "Sam", "start": 46, "end": 51, "text": "Signal weak… but I must send data so Earth can learn." },
            { "speaker": "Mira", "start": 51, "end": 58, "text": "Yes, Sam! Even during storms, sharing data helps us understand and prepare for the next one." },
            { "speaker": "Sam", "start": 58, "end":64, "text": "Professor Mira, storm data saved. Sending report… holding steady!" },
            { "speaker": "Mira", "start": 64, "end": 72, "text": "Sam, you did wonderfully! You survived the solar storm and gave us valuable information." },
            { "speaker": "Sam", "start": 72, "end": 78, "text": "Phew! That was tough, but now we know how solar storms affect satellites." },
            { "speaker": "Mira", "start": 78, "end": 88, "text": "Exactly, Sam. Every challenge is a lesson. From storms, we learn how to protect satellites, power grids, and even people on Earth." }
        ]
    },
    "astronomerAmyContainer": {
        "title": "Observatory: Solar Wind",
        "audioSrc": "audio/Amy_Leo_convo.mp3",
        "transcript": [
            { "speaker": "Amy", "start": 0, "end": 11, "text": "Leo, look! The solar wind is stronger tonight. I can see the auroras forming. It’s... breathtaking!" },
            { "speaker": "Leo", "start": 11, "end": 18, "text": "Whoa! It almost looks like the sky is alive. Do you really think it’s safe to observe it so closely?" },
            { "speaker": "Amy", "start": 18, "end": 28, "text": "Absolutely! We have the shields in place. Plus, this might be the biggest solar storm of the year. If we record it, it could teach us so much." },
            { "speaker": "Leo", "start": 28, "end": 35, "text": "The readings are intense. Extreme magnetospheric activity—if we’re not careful, instruments could get damaged." },
            { "speaker": "Amy", "start": 35, "end": 45, "text": "I understand, but this is a rare chance to study the solar wind interacting with Earth’s magnetosphere in real time. The scientific payoff could be huge!" },
            { "speaker": "Leo", "start": 45, "end": 48, "text": "And it’ll look epic on the star charts!" },
            { "speaker": "Amy", "start": 48, "end": 57, "text": "Leo... look at that. The solar wind dancing through the magnetosphere... it’s like the universe itself is performing." },
            { "speaker": "Leo", "start": 57, "end": 61, "text": "It’s mesmerizing! I’ve never seen anything like this!" },
            { "speaker": "Amy", "start": 61, "end": 66, "text": "Stay focused. Measure the intensity — record everything!" },
            { "speaker": "Amy", "start": 66, "end": 77, "text": "Leo, we need to stabilize the sensors! If they fail, we lose all data!" },
            { "speaker": "Leo", "start": 77, "end": 80, "text": "On it! Adjusting the shield controls… now!" },
            { "speaker": "Amy", "start": 80, "end": 93, "text": "This... this is history in the making. I can feel the energy in the air!" },
            { "speaker": "Leo", "start": 93, "end": 99, "text": "Phew! Data safe... but did you see that? It’s alive!" },
            { "speaker": "Amy", "start": 99, "end": 107, "text": "Remarkable... we’ve captured something truly extraordinary. This will advance our understanding of space weather for decades!" },
            { "speaker": "Leo", "start": 107, "end": 115, "text": "And it reminds us — even in the chaos of a storm, there’s beauty. Science lets us see it, and learn from it." },
            { "speaker": "Amy", "start": 115, "end": 127, "text": "Leo, next time someone asks why I became an astronomer, I’ll show them tonight." },
            { "speaker": "Leo", "start": 127, "end": 134, "text": "I’ll never forget this... the solar wind dancing through the magnetosphere. Amazing to watch, indeed." },
            { "speaker": "Amy", "start": 134, "end": 140, "text": "And amazing to study. Knowledge and wonder, together — that’s why we look to the stars." }
        ]
    },
    "balloonContainer": {
        "title": "High-Altitude Balloon SEP",
        "audioSrc": "audio/abrar_sana_convo.mp3",
        "transcript": [
            { "speaker": "Abrar", "start": 0, "end": 5, "text": "Sana, all instruments are calibrated. This balloon will reach 35 km—right into the stratosphere." },
            { "speaker": "Sana", "start": 5, "end": 11, "text": "Looks perfect, Abrar. But the Sun’s been unusually active. Do you think we’ll face any solar particles?" },
            { "speaker": "Abrar", "start": 11, "end": 23, "text": "Possibly. High-altitude balloons are sensitive to space weather, especially SEPs. If a solar energetic particle burst hits, our sensors could get overwhelmed." },
            { "speaker": "Abrar", "start": 23, "end": 28, "text": "Sana, look! Our solar radiation monitors are spiking. A SEP event is in progress." },
            { "speaker": "Sana", "start": 28, "end": 33, "text": "The instruments are showing high-energy protons from the Sun? But we’re just a balloon!" },
            { "speaker": "Abrar", "start": 33, "end": 44, "text": "Even here, SEPs penetrate the upper atmosphere. They can scramble electronics, overload sensors, and distort measurements." },
            { "speaker": "Abrar", "start": 44, "end": 51, "text": "Quickly! Activate the redundant power shields and switch critical instruments to safe mode. We need to protect the data we’ve already collected." },
            { "speaker": "Sana", "start": 51, "end": 55, "text": "I’ve isolated the most sensitive sensors and started logging only essential readings." },
            { "speaker": "Abrar", "start": 55, "end": 66, "text": "Good. Adaptability is key—balloons can’t dodge particles like satellites, so we must shield, reroute power, and monitor continuously." },
            { "speaker": "Abrar", "start": 66, "end": 72, "text": "Even with high radiation, our backup instruments are holding. The event itself is a learning opportunity." },
            { "speaker": "Sana", "start": 72, "end": 76, "text": "We can study how SEPs interact with the upper atmosphere and magnetic fields." },
            { "speaker": "Abrar", "start": 76, "end": 83, "text": "Exactly. Each storm teaches us how to design better electronics, prepare instruments, and predict impacts for future missions." },
            { "speaker": "Sana", "start": 83, "end": 87, "text": "Radiation levels are dropping. The balloon is stable, and data looks clean." },
            { "speaker": "Abrar", "start": 87, "end": 92, "text": "Mission success. We survived the SEP and gathered invaluable measurements." },
            { "speaker": "Sana", "start": 92, "end": 99, "text": "So the lesson is: preparation, shielding, and adaptive monitoring make research safe even in extreme conditions." },
            { "speaker": "Abrar", "start": 99, "end": 107, "text": "Yes. High-altitude experiments aren’t just about observation—they teach resilience, planning, and how the Sun affects our world." },
            { "speaker": "Abrar", "start": 107, "end": 124, "text": "SEPs are bursts of high-energy particles from the Sun. They can penetrate the upper atmosphere, disrupt instruments, and distort data—even for balloons. But by using shielding, redundant systems, and careful monitoring, scientists can safely study the sky and learn from these extreme events." },
            { "speaker": "Sana", "start": 124, "end": 130, "text": "And remember: preparation and understanding turn even solar storms into discoveries and knowledge." }
        ]
    },
    "spaceBotanistContainer": {
        "title": "Space Botanist & SEP",
        "audioSrc": "audio/Leela_raj_convo.mp3",
        "transcript": [
            { "speaker": "Leela", "start": 0, "end": 6, "text": "Commander, the lettuce and beans are thriving—microgravity farming is working better than expected." },
            { "speaker": "Raj", "start": 6, "end": 12, "text": "Excellent, Leela. Someday astronauts on Mars will thank you for this food research." },
            { "speaker": "Leela", "start": 12, "end": 15, "text": "Radiation alert? What’s happening?" },
            { "speaker": "Raj", "start": 15, "end": 21, "text": "It’s a Solar Energetic Particle event. High-energy protons from the Sun are hitting near-Earth space." },
            { "speaker": "Leela", "start": 21, "end": 26, "text": "That means extra radiation exposure for us… and even the plants, right?" },
            { "speaker": "Raj", "start": 26, "end": 34, "text": "Exactly. SEPs can damage DNA in living cells—human or plant—if we don’t shield them properly." },
            { "speaker": "Leela", "start": 34, "end": 41, "text": "Let’s move the most sensitive plants into the shielded growth chamber. Its water walls block radiation better." },
            { "speaker": "Raj", "start": 41, "end": 47, "text": "Good thinking. I’ll also guide the crew into the storm shelter module until levels drop." },
            { "speaker": "Leela", "start": 47, "end": 54, "text": "If our crops survive this, we’ll learn how to harden future space greenhouses." },
            { "speaker": "Raj", "start": 54, "end": 60, "text": "And if they don’t, that’s still data—knowing what fails is as important as what grows." },
            { "speaker": "Leela", "start": 60, "end": 67, "text": "It’s humbling… these tiny particles from the Sun can decide whether we can grow food on other planets." },
            { "speaker": "Raj", "start": 67, "end": 73, "text": "True. That’s why we test shielding, water barriers, and crop resilience here in orbit." },
            { "speaker": "Leela", "start": 73, "end": 81, "text": "So the lesson is: food security in space isn’t just about water and light—it’s about radiation protection." },
            { "speaker": "Raj", "start": 81, "end": 90, "text": "Exactly. If astronauts can’t grow food safely, deep space missions will always depend on fragile supply chains." },
            { "speaker": "Raj", "start": 90, "end": 94, "text": "Radiation levels dropping. Crew safe. Systems normal." },
            { "speaker": "Leela", "start": 94, "end": 99, "text": "Some leaves show stress, but most are still green." },
            { "speaker": "Raj", "start": 99, "end": 101, "text": "That means your shielding design worked." },
            { "speaker": "Leela", "start": 101, "end": 110, "text": "Yes. We turned a dangerous storm into proof that future astronauts might eat fresh salad on Mars." },
            { "speaker": "Leela", "start": 110, "end": 121, "text": "Solar Energetic Particles may be invisible, but they shape our survival in space. Protecting both people and plants from radiation is the key to living beyond Earth." }
        ]
    },
    "glacierContainer": {
        "title": "Glacier Research & SEPs",
        "audioSrc": "audio/Omar_lina_convo.mp3",
        "transcript": [
            { "speaker": "Lina", "start": 0, "end": 9, "text": "These layers hold thousands of years of climate history—volcano eruptions, ancient temperatures, even solar activity." },
            { "speaker": "Omar", "start": 9, "end": 15, "text": "Our sensors are logging ice density, radiation traces, and isotopes. Everything is stable." },
            { "speaker": "Lina", "start": 15, "end": 23, "text": "That’s no glitch. A Solar Energetic Particle event is hitting us—high-energy protons from a solar flare." },
            { "speaker": "Omar", "start": 23, "end": 27, "text": "Radiation levels have spiked fivefold in less than 20 minutes!" },
            { "speaker": "Lina", "start": 27, "end": 34, "text": "That’s how SEPs behave—they travel at nearly the speed of light. No time to react if unprepared." },
            { "speaker": "Omar", "start": 34, "end": 40, "text": "Our GPS coordinates are jumping by several meters. Satellite communication is gone." },
            { "speaker": "Lina", "start": 40, "end": 48, "text": "Exactly what SEPs do—ionizing the polar atmosphere, scrambling satellite signals, and disrupting navigation." },
            { "speaker": "Lina", "start": 48, "end": 56, "text": "Shut down all unshielded electronics—mass spectrometer, isotope scanner. If radiation burns their circuits, months of data will be lost." },
            { "speaker": "Omar", "start": 56, "end": 61, "text": "Switching to shielded backups in the Faraday case. What about power?" },
            { "speaker": "Lina", "start": 61, "end": 66, "text": "Rely on the insulated battery packs. Grid links are unreliable during strong solar storms." },
            { "speaker": "Omar", "start": 66, "end": 68, "text": "Navigation fallback?" },
            { "speaker": "Lina", "start": 68, "end": 80, "text": "Manual—compass, physical maps, and marked flagpoles on the ice. Analog never fails." },
            { "speaker": "Omar", "start": 80, "end": 83, "text": "Incredible… these green arcs look alive." },
            { "speaker": "Lina", "start": 83, "end": 95, "text": "That’s SEP interaction with the polar atmosphere. Beautiful, but the same radiation that powers auroras can damage DNA, fry satellites, and blind sensors." },
            { "speaker": "Omar", "start": 95, "end": 99, "text": "So SEPs don’t just affect astronauts in space?" },
            { "speaker": "Lina", "start": 99, "end": 112, "text": "No—they’re strongest over the poles. That’s why airlines reroute flights during major SEP storms. Even we, on the ground, need radiation shielding for sensitive instruments." },
            { "speaker": "Omar", "start": 112, "end": 114, "text": "And our ice cores?" },
            { "speaker": "Lina", "start": 114, "end": 130, "text": "Ironically, they record solar storms too. Layers rich in beryllium-10 and carbon-14 isotopes show past SEP events. Today’s storm is tomorrow’s history inside the ice." },
            { "speaker": "Omar", "start": 130, "end": 134, "text": "Sat-link is back. Data transmissions restored." },
            { "speaker": "Lina", "start": 134, "end": 140, "text": "Good. We protected our equipment, adapted to analog methods, and gained rare real-time SEP data." },
            { "speaker": "Omar", "start": 140, "end": 143, "text": "This storm could’ve destroyed months of research." },
            { "speaker": "Lina", "start": 143, "end": 150, "text": "Instead, it became part of our research. Every challenge from the Sun teaches us resilience, science, and humility." },
            { "speaker": "Omar", "start": 150, "end": 158, "text": "So SEP storms aren’t just space problems—they ripple down to ice, instruments, even polar explorers." },
            { "speaker": "Lina", "start": 158, "end": 169, "text": "Exactly. Solar Energetic Particles test both humans and machines, but with knowledge, shielding, and adaptability, we can turn danger into discovery." }
        ]
    },
    "astroAnikaContainer": {
        "title": "Anika & Mission Control",
        "audioSrc": "audio/Anika_MC_convo.mp3",
        "transcript": [
            { "speaker": "Anika", "start": 0, "end": 6, "text": "Mission Control, it’s a beautiful day in orbit. Earth looks peaceful, and my instruments are stable." },
            { "speaker": "MC", "start": 6, "end": 13, "text": "Copy that, Anika. But remember—space weather can change suddenly. We’re monitoring solar activity." },
            { "speaker": "Anika", "start": 13, "end": 19, "text": "Understood. Hard to imagine danger when everything looks so quiet." },
            { "speaker": "Anika", "start": 19, "end": 22, "text": "Warning lights flashing—radiation levels spiking!" },
            { "speaker": "MC", "start": 22, "end": 31, "text": "Anika, a solar energetic particle storm just hit. High-energy protons from the Sun are flooding near-Earth space." },
            { "speaker": "Anika", "start": 31, "end": 34, "text": "That explains the radiation alert. What’s the danger?" },
            { "speaker": "MC", "start": 34, "end": 40, "text": "SEPs can damage electronics… and prolonged exposure is harmful to your health." },
            { "speaker": "MC", "start": 40, "end": 44, "text": "Move quickly to the storm shelter module. It has extra shielding." },
            { "speaker": "Anika", "start": 44, "end": 47, "text": "On my way. Should I shut down experiments?" },
            { "speaker": "MC", "start": 47, "end": 52, "text": "Yes. Power down sensitive instruments to protect them from particle damage." },
            { "speaker": "Anika", "start": 52, "end": 58, "text": "Shelter sealed. Radiation monitors active. Waiting for levels to stabilize." },
            { "speaker": "Anika", "start": 58, "end": 66, "text": "Mission Control… it’s humbling. We’re so advanced, but a burst from the Sun can still threaten us." },
            { "speaker": "MC", "start": 66, "end": 73, "text": "That’s why we track solar activity. SEPs remind us of the Sun’s power—and the need for protection." },
            { "speaker": "Anika", "start": 73, "end": 82, "text": "So the lesson is: in space, preparation saves lives. Radiation shielding isn’t optional—it’s survival." },
            { "speaker": "MC", "start": 82, "end": 88, "text": "Exactly. Every storm teaches us how to design safer spacecraft and protect future explorers." },
            { "speaker": "MC", "start": 88, "end": 93, "text": "Radiation levels returning to normal. Safe to leave the shelter." },
            { "speaker": "Anika", "start": 93, "end": 97, "text": "Back to the workstation. Equipment secure, and I’m safe." },
            { "speaker": "MC", "start": 97, "end": 101, "text": "Well done, Anika. You handled the storm calmly and effectively." },
            { "speaker": "Anika", "start": 101, "end": 109, "text": "The Sun is both our giver of life and our greatest challenge. Every storm teaches us respect." },
            { "speaker": "Anika", "start": 109, "end": 131, "text": "Solar Energetic Particles are high-energy bursts from the Sun that can harm astronauts, damage spacecraft, and disrupt satellites—but by using storm shelters, shutting down electronics, and monitoring radiation carefully, we turn each storm into a lesson and stay safe while exploring space." }
        ]
    }
}

